# Part of case-study #5
# Developers: Khramchikhina A., Peshkov Y., Sanzhanova A., Yurshenaite A.
#

INFORMATION = '''Вам предстоит сыграть в Русскую Рулетку, не будем долго томить и сразу перейдём к правилам игры.
Сначала игроки играют друг против друга, каждая пара по 1 раунду, победители выходят в финал и играют 3 раунда. 
Каждому игроку даётся по 3 очка здоровья.
Боевой патрон отнимает одну единицу здоровья.
В каждом раунде 5 холостых и 5 заряженных патрона.
Перед вами предстоит выбор: выстрелить в себя или в другого игрока.
Если вы стреляете в себя, то следующий ход остаётся за вами. В противном случае - переходит к оппоненту.
В начале каждого раунда вам в случайном порядке выдаётся инвентарь.
Функционал каждого предмета следующий:
 - Очки помогают увидеть какой патрон следующий: холостой или боевой;
 - Пила позволяет нанести двойной урон от выстрела;
 - Наручники заставляют оппонента пропустить ход;
 - Молочный коктейль восстанавливает одну единицу здоровья;
 - Мишень даёт возможность выстрелить в другую сторону.
                    ВСЕМ УДАЧИ.'''
TEAMS_1 = 'В 1 раунде встречаются игрок '
AND = ' и игрок '
TEAMS_2 = 'Во 2 раунде встречаются игрок '
ROUND = 'Раунд'
EMPTY_BULLET = 'Холостой патрон'
COMBAT_BULLET = 'Заряженный патрон'
HEALTH = 'Очки здоровья:'
GLASSES = 'Очки'
SAW = 'Пила'
HANDCUFFS = 'Наручники'
MILKSHAKE = 'Молочный коктейль'
TARGET = 'Мишень'
MOVE_1 = 'Ход 1 игрока'
MOVES = '''    1. Выстрелить в себя;
    2. Выстрелить в противника.'''
NOTHING = 'Не использовать предмет'
YOUR_ARSENAL = 'Ваш арсенал:'
OBJECT = 'Выберите один предмет: '
MISTAKE = 'У вас нет этого предмета. Выберите другой'
SHOT_CHOICE = 'Ваш выбор: '
THROW_AWAY = 'Вы выкинули '
SHOT_COMBAT_1 = 'Вы выстрелили в себя заряженным патроном.'
SHOT_EMPTY_1 = 'Вы выстрелили в себя холостым патроном.'
SHOT_COMBAT_2 = 'Вы выстрелили в противника заряженным патроном.'
SHOT_EMPTY_2 = 'Вы выстрелили в противника холостым патроном.'
DEATH_1 = 'Смерть! Game over! Победа за вторым игроком.'
DEATH_2 = 'Смерть! Game over! Победа за первым игроком.'
MOVE_2 = 'Ход 2 игрока'
FINAL_ROUND = 'Финальный раунд'
RELOADING = 'Обойма перезаряжена'
DEATH_1_F = 'Смерть! Game over! Победа за вторым игроком. Вы абсолютный чемпион!'
DEATH_2_F = 'Смерть! Game over! Победа за первым игроком. Вы абсолютный чемпион!'
